# Исполнитель преобразует число на экране.
# У исполнителя есть три команды, которые обозначены латинскими буквами:
# A. Прибавить 1
# B. Умножить на 2
# C. Возвести в квадрат
# Программа для исполнителя — это последовательность команд.
# Сколько существует программ, для которых при исходном числе 8 результат —
# число 115, при этом траектория вычислений содержит число 32 и не содержит 33?
# Траектория вычислений программы — это последовательность результатов
# выполнения всех команд программы. Например, для программы CBA при исходном
# числе 4 траектория будет состоять из чисел 16, 32, 33.

# Вывести только одно число - ответ.
