# Исполнитель Егорыч-2004 преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
# 1. Прибавь ближайшее простое число (большее самого числа)
# 2. Прибавь следующее число, являющиеся степенью двойки
# 3. Прибавь последнюю цифру, если она не равна нулю
#
# Для примера рассмотрим команды для числа 15:
# 1. Ближайшее простое число для него равно 17. Результатом выполнения этой командой будет 15+17=32.
# 2. Ближайшее число, являющиеся степенью двойки для него равно 16. Результатом выполнения этой командой будет 15+16=31.
# 3. Результатом выполнения этой командой будет 15+5=20.
#
# Сколько существует программ, которые преобразуют исходное число 2 в число 3072, содержит число 1024 и не содержит чисел 3 и 14?
# В ответе выведите искомое количество программ.


