# Исполнитель Калькулятор преобразует число, записанное на экране. У исполнителя есть три команды, которым присвоены номера:
# A. Прибавить 2.
# Б. Прибавить 3.
# С. Умножить на 2 и прибавить 1.
# Первая команда увеличивает на 2, вторая – увеличивает на 3, третья – умножает на 2 и увеличивает на 1.
# Сколько существует таких программ, которые исходное число 1 преобразуют в число 625,
# и при этом траектория содержит не более 4-х нечётных чисел.
# В ответе должно быть выведено только одно число.



